---
title: ExportLinetypeTable
classe: Autodesk.Revit.DB.ExportLinetypeTable
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# ExportLinetypeTable

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Count { get; }` | `exportLinetypeTable.Count` | Int32 |
| `Boolean IsValidObject { get; }` | `exportLinetypeTable.IsValidObject` | Boolean |
| `ExportLinetypeInfo Item { get; set; }` | `exportLinetypeTable.Item` | ExportLinetypeInfo |
| `Void Add(ExportLinetypeKey, ExportLinetypeInfo)` | `exportLinetypeTable.Add(exportLinetypeKey, exportLinetypeInfo)` | Void |
| `Void Clear()` | `exportLinetypeTable.Clear()` | Void |
| `Boolean ContainsKey(ExportLinetypeKey)` | `exportLinetypeTable.ContainsKey(exportLinetypeKey)` | Boolean |
| `Void Dispose()` | `exportLinetypeTable.Dispose()` | Void |
| `IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>> GetEnumerator()` | `exportLinetypeTable.GetEnumerator()` | IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>> |
| `ExportLinetypeInfo GetExportLinetypeInfo(ExportLinetypeKey)` | `exportLinetypeTable.GetExportLinetypeInfo(exportLinetypeKey)` | ExportLinetypeInfo |
| `IList<ExportLinetypeKey> GetKeys()` | `exportLinetypeTable.GetKeys()` | IList<ExportLinetypeKey> |
| `ExportLinetypeTableIterator GetLinetypeTableIterator()` | `exportLinetypeTable.GetLinetypeTableIterator()` | ExportLinetypeTableIterator |
| `IList<ExportLinetypeInfo> GetValues()` | `exportLinetypeTable.GetValues()` | IList<ExportLinetypeInfo> |
| `Void Remove(ExportLinetypeKey)` | `exportLinetypeTable.Remove(exportLinetypeKey)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```